lkolbly/cmsis-svd/data/TexasInstruments/LM4F231H5QR.svd
        <register>
          <name>_2_FLTSRC0</name>
          <description>PWM2 Fault Source 0</description>
          <addressOffset>0x000000F4</addressOffset>
        </register>
        <register>
          <name>_2_FLTSRC1</name>
          <description>PWM2 Fault Source 1</description>
          <addressOffset>0x000000F8</addressOffset>
        </register>
        <register>
          <name>_2_MINFLTPER</name>
          <description>PWM2 Minimum Fault Period</description>
          <addressOffset>0x000000FC</addressOffset>
        </register>
        <register>
          <name>_3_CTL</name>
          <description>PWM3 Control</description>
          <addressOffset>0x00000100</addressOffset>
        </register>
        <register>
          <name>_3_INTEN</name>
          <description>PWM3 Interrupt and Trigger Enable</description>
          <addressOffset>0x00000104</addressOffset>
        </register>
        <register>
          <name>_3_RIS</name>
          <description>PWM3 Raw Interrupt Status</description>
          <addressOffset>0x00000108</addressOffset>
        </register>
        <register>
          <name>_3_ISC</name>
          <description>PWM3 Interrupt Status and Clear</description>
          <addressOffset>0x0000010C</addressOffset>
        </register>
        <register>
          <name>_3_LOAD</name>
          <description>PWM3 Load</description>
          <addressOffset>0x00000110</addressOffset>
        </register>
        <register>
          <name>_3_COUNT</name>
          <description>PWM3 Counter</description>
          <addressOffset>0x00000114</addressOffset>
        </register>
        <register>
          <name>_3_CMPA</name>
          <description>PWM3 Compare A</description>
          <addressOffset>0x00000118</addressOffset>
        </register>
        <register>
          <name>_3_CMPB</name>
          <description>PWM3 Compare B</description>
          <addressOffset>0x0000011C</addressOffset>
        </register>
        <register>
          <name>_3_GENA</name>
          <description>PWM3 Generator A Control</description>
          <addressOffset>0x00000120</addressOffset>
        </register>
        <register>
          <name>_3_GENB</name>
          <description>PWM3 Generator B Control</description>
          <addressOffset>0x00000124</addressOffset>
        </register>
        <register>
          <name>_3_DBCTL</name>
          <description>PWM3 Dead-Band Control</description>
          <addressOffset>0x00000128</addressOffset>
        </register>
        <register>
          <name>_3_DBRISE</name>
          <description>PWM3 Dead-Band Rising-Edge Delay</description>
          <addressOffset>0x0000012C</addressOffset>
        </register>
        <register>
          <name>_3_DBFALL</name>
          <description>PWM3 Dead-Band Falling-Edge-Delay</description>
          <addressOffset>0x00000130</addressOffset>
        </register>
        <register>
          <name>_3_FLTSRC0</name>
          <description>PWM3 Fault Source 0</description>
          <addressOffset>0x00000134</addressOffset>
        </register>
        <register>
          <name>_3_FLTSRC1</name>
          <description>PWM3 Fault Source 1</description>
          <addressOffset>0x00000138</addressOffset>
        </register>
        <register>
          <name>_3_MINFLTPER</name>
          <description>PWM3 Minimum Fault Period</description>
          <addressOffset>0x0000013C</addressOffset>
        </register>
        <register>
          <name>_0_FLTSEN</name>
          <description>PWM0 Fault Pin Logic Sense</description>
          <addressOffset>0x00000800</addressOffset>
          <fields>
            <field>
              <name>PWM_X_FLTSEN_FAULT0</name>
              <description>Fault0 Sense</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>PWM_X_FLTSEN_FAULT1</name>
              <description>Fault1 Sense</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>PWM_X_FLTSEN_FAULT2</name>
              <description>Fault2 Sense</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>PWM_X_FLTSEN_FAULT3</name>
              <description>Fault3 Sense</description>
              <bitRange>[3:3]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>_0_FLTSTAT0</name>
          <description>PWM0 Fault Status 0</description>
          <addressOffset>0x00000804</addressOffset>
          <access>read-only</access>
          <fields>
            <field>
              <name>PWM_X_FLTSTAT0_FAULT0</name>
              <description>Fault Input 0</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>PWM_X_FLTSTAT0_FAULT1</name>
              <description>Fault Input 1</description>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>PWM_X_FLTSTAT0_FAULT2</name>
              <description>Fault Input 2</description>
              <bitRange>[2:2]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>PWM_X_FLTSTAT0_FAULT3</name>
              <description>Fault Input 3</description>
              <bitRange>[3:3]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>_0_FLTSTAT1</name>
          <description>PWM0 Fault Status 1</description>
          <addressOffset>0x00000808</addressOffset>
          <access>read-only</access>
          <fields>
            <field>
              <name>PWM_X_FLTSTAT1_DCMP0</name>
              <description>Digital Comparator 0 Trigger</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>PWM_X_FLTSTAT1_DCMP1</name>
              <description>Digital Comparator 1 Trigger</description>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>PWM_X_FLTSTAT1_DCMP2</name>
              <description>Digital Comparator 2 Trigger</description>
              <bitRange>[2:2]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>PWM_X_FLTSTAT1_DCMP3</name>
              <description>Digital Comparator 3 Trigger</description>
              <bitRange>[3:3]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>PWM_X_FLTSTAT1_DCMP4</name>
              <description>Digital Comparator 4 Trigger</description>
              <bitRange>[4:4]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>PWM_X_FLTSTAT1_DCMP5</name>
              <description>Digital Comparator 5 Trigger</description>
              <bitRange>[5:5]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>PWM_X_FLTSTAT1_DCMP6</name>
              <description>Digital Comparator 6 Trigger</description>
              <bitRange>[6:6]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>PWM_X_FLTSTAT1_DCMP7</name>
              <description>Digital Comparator 7 Trigger</description>
              <bitRange>[7:7]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>_1_FLTSEN</name>
          <description>PWM1 Fault Pin Logic Sense</description>
          <addressOffset>0x00000880</addressOffset>
        </register>
        <register>
          <name>_1_FLTSTAT0</name>
          <description>PWM1 Fault Status 0</description>
          <addressOffset>0x00000884</addressOffset>
          <access>read-only</access>
        </register>
        <register>
          <name>_1_FLTSTAT1</name>
          <description>PWM1 Fault Status 1</description>
          <addressOffset>0x00000888</addressOffset>
          <access>read-only</access>
        </register>
        <register>
          <name>_2_FLTSEN</name>
          <description>PWM2 Fault Pin Logic Sense</description>
          <addressOffset>0x00000900</addressOffset>
        </register>
        <register>
          <name>_2_FLTSTAT0</name>
          <description>PWM2 Fault Status 0</description>
          <addressOffset>0x00000904</addressOffset>
          <access>read-only</access>
        </register>
        <register>
          <name>_2_FLTSTAT1</name>
          <description>PWM2 Fault Status 1</description>
          <addressOffset>0x00000908</addressOffset>
          <access>read-only</access>
        </register>
        <register>
          <name>_3_FLTSEN</name>
          <description>PWM3 Fault Pin Logic Sense</description>
          <addressOffset>0x00000980</addressOffset>
        </register>
        <register>
          <name>_3_FLTSTAT0</name>
          <description>PWM3 Fault Status 0</description>
          <addressOffset>0x00000984</addressOffset>
          <access>read-only</access>
        </register>
        <register>
          <name>_3_FLTSTAT1</name>
          <description>PWM3 Fault Status 1</description>
          <addressOffset>0x00000988</addressOffset>
          <access>read-only</access>
        </register>
        <register>
          <name>PP</name>
          <description>PWM Peripheral Properties</description>
          <addressOffset>0x00000FC0</addressOffset>
          <fields>
            <field>
              <name>PWM_PP_GCNT</name>
              <description>Generators</description>
              <bitRange>[3:0]</bitRange>
            </field>
            <field>
              <name>PWM_PP_FCNT</name>
              <description>Fault Inputs</description>
              <bitRange>[7:4]</bitRange>
            </field>
            <field>
              <name>PWM_PP_ESYNC</name>
              <description>Extended Synchronization</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>PWM_PP_EFAULT</name>
              <description>Extended Fault</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>PWM_PP_ONE</name>
              <description>One-Shot Mode</description>
              <bitRange>[10:10]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PC</name>
          <description>PWM Peripheral Configuration</description>
          <addressOffset>0x00000FC4</addressOffset>
          <fields>
            <field>
              <name>PWM_PC_PWMDIV</name>
              <description>PWM Clock Divisor</description>
              <bitRange>[7:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PWM_PC_PWMDIV_2</name>
                  <description>/2</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_PC_PWMDIV_4</name>
                  <description>/4</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_PC_PWMDIV_8</name>
                  <description>/8</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_PC_PWMDIV_16</name>
                  <description>/16</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_PC_PWMDIV_32</name>
                  <description>/32</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_PC_PWMDIV_64</name>
                  <description>/64 (default)</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWM_PC_USEOPWMDIV</name>
              <description>Enable PWM Clock Divisor</description>
              <bitRange>[8:8]</bitRange>
            </field>
          </fields>
        </register>
