lkolbly/cmsis-svd/data/TexasInstruments/LM4F231H5QR.svd
        <register>
          <name>EPC</name>
          <description>USB External Power Control</description>
          <addressOffset>0x00000400</addressOffset>
          <fields>
            <field>
              <name>USB_EPC_EPEN</name>
              <description>External Power Supply Enable Configuration</description>
              <bitRange>[1:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>USB_EPC_EPEN_LOW</name>
                  <description>Power Enable Active Low</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_EPC_EPEN_HIGH</name>
                  <description>Power Enable Active High</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_EPC_EPEN_VBLOW</name>
                  <description>Power Enable High if VBUS Low</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_EPC_EPEN_VBHIGH</name>
                  <description>Power Enable High if VBUS High</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>USB_EPC_EPENDE</name>
              <description>EPEN Drive Enable</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>USB_EPC_PFLTEN</name>
              <description>Power Fault Input Enable</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>USB_EPC_PFLTSEN_HIGH</name>
              <description>Power Fault Sense</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>USB_EPC_PFLTAEN</name>
              <description>Power Fault Action Enable</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>USB_EPC_PFLTACT</name>
              <description>Power Fault Action</description>
              <bitRange>[9:8]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>USB_EPC_PFLTACT_UNCHG</name>
                  <description>Unchanged</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_EPC_PFLTACT_TRIS</name>
                  <description>Tristate</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_EPC_PFLTACT_LOW</name>
                  <description>Low</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_EPC_PFLTACT_HIGH</name>
                  <description>High</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EPCRIS</name>
          <description>USB External Power Control Raw Interrupt Status</description>
          <addressOffset>0x00000404</addressOffset>
          <fields>
            <field>
              <name>USB_EPCRIS_PF</name>
              <description>USB Power Fault Interrupt Status</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>EPCIM</name>
          <description>USB External Power Control Interrupt Mask</description>
          <addressOffset>0x00000408</addressOffset>
          <fields>
            <field>
              <name>USB_EPCIM_PF</name>
              <description>USB Power Fault Interrupt Mask</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>EPCISC</name>
          <description>USB External Power Control Interrupt Status and Clear</description>
          <addressOffset>0x0000040C</addressOffset>
          <fields>
            <field>
              <name>USB_EPCISC_PF</name>
              <description>USB Power Fault Interrupt Status and Clear</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DRRIS</name>
          <description>USB Device RESUME Raw Interrupt Status</description>
          <addressOffset>0x00000410</addressOffset>
          <fields>
            <field>
              <name>USB_DRRIS_RESUME</name>
              <description>RESUME Interrupt Status</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DRIM</name>
          <description>USB Device RESUME Interrupt Mask</description>
          <addressOffset>0x00000414</addressOffset>
          <fields>
            <field>
              <name>USB_DRIM_RESUME</name>
              <description>RESUME Interrupt Mask</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DRISC</name>
          <description>USB Device RESUME Interrupt Status and Clear</description>
          <addressOffset>0x00000418</addressOffset>
          <access>write-only</access>
          <fields>
            <field>
              <name>USB_DRISC_RESUME</name>
              <description>RESUME Interrupt Status and Clear</description>
              <bitRange>[0:0]</bitRange>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GPCS</name>
          <description>USB General-Purpose Control and Status</description>
          <addressOffset>0x0000041C</addressOffset>
          <fields>
            <field>
              <name>USB_GPCS_DEVMOD</name>
              <description>Device Mode</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>USB_GPCS_DEVMODOTG</name>
              <description>Enable Device Mode</description>
              <bitRange>[1:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>VDC</name>
          <description>USB VBUS Droop Control</description>
          <addressOffset>0x00000430</addressOffset>
          <fields>
            <field>
              <name>USB_VDC_VBDEN</name>
              <description>VBUS Droop Enable</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>VDCRIS</name>
          <description>USB VBUS Droop Control Raw Interrupt Status</description>
          <addressOffset>0x00000434</addressOffset>
          <fields>
            <field>
              <name>USB_VDCRIS_VD</name>
              <description>VBUS Droop Raw Interrupt Status</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>VDCIM</name>
          <description>USB VBUS Droop Control Interrupt Mask</description>
          <addressOffset>0x00000438</addressOffset>
          <fields>
            <field>
              <name>USB_VDCIM_VD</name>
              <description>VBUS Droop Interrupt Mask</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>VDCISC</name>
          <description>USB VBUS Droop Control Interrupt Status and Clear</description>
          <addressOffset>0x0000043C</addressOffset>
          <fields>
            <field>
              <name>USB_VDCISC_VD</name>
              <description>VBUS Droop Interrupt Status and Clear</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IDVRIS</name>
          <description>USB ID Valid Detect Raw Interrupt Status</description>
          <addressOffset>0x00000444</addressOffset>
          <fields>
            <field>
              <name>USB_IDVRIS_ID</name>
              <description>ID Valid Detect Raw Interrupt Status</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IDVIM</name>
          <description>USB ID Valid Detect Interrupt Mask</description>
          <addressOffset>0x00000448</addressOffset>
          <fields>
            <field>
              <name>USB_IDVIM_ID</name>
              <description>ID Valid Detect Interrupt Mask</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IDVISC</name>
          <description>USB ID Valid Detect Interrupt Status and Clear</description>
          <addressOffset>0x0000044C</addressOffset>
          <fields>
            <field>
              <name>USB_IDVISC_ID</name>
              <description>ID Valid Detect Interrupt Status and Clear</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DMASEL</name>
          <description>USB DMA Select</description>
          <addressOffset>0x00000450</addressOffset>
          <fields>
            <field>
              <name>USB_DMASEL_DMAARX</name>
              <description>DMA A RX Select</description>
              <bitRange>[3:0]</bitRange>
            </field>
            <field>
              <name>USB_DMASEL_DMAATX</name>
              <description>DMA A TX Select</description>
              <bitRange>[7:4]</bitRange>
            </field>
            <field>
              <name>USB_DMASEL_DMABRX</name>
              <description>DMA B RX Select</description>
              <bitRange>[11:8]</bitRange>
            </field>
            <field>
              <name>USB_DMASEL_DMABTX</name>
              <description>DMA B TX Select</description>
              <bitRange>[15:12]</bitRange>
            </field>
            <field>
              <name>USB_DMASEL_DMACRX</name>
              <description>DMA C RX Select</description>
              <bitRange>[19:16]</bitRange>
            </field>
            <field>
              <name>USB_DMASEL_DMACTX</name>
              <description>DMA C TX Select</description>
              <bitRange>[23:20]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PP</name>
          <description>USB Peripheral Properties</description>
          <addressOffset>0x00000FC0</addressOffset>
          <fields>
            <field>
              <name>USB_PP_TYPE</name>
              <description>Controller Type</description>
              <bitRange>[3:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>USB_PP_TYPE_0</name>
                  <description>The first-generation USB controller</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>USB_PP_PHY</name>
              <description>PHY Present</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>USB_PP_USB</name>
              <description>USB Capability</description>
              <bitRange>[7:6]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>USB_PP_USB_DEVICE</name>
                  <description>DEVICE</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_PP_USB_HOSTDEVICE</name>
                  <description>HOST</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_PP_USB_OTG</name>
                  <description>OTG</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>USB_PP_ECNT</name>
              <description>Endpoint Count</description>
              <bitRange>[15:8]</bitRange>
            </field>
          </fields>
        </register>
